### SQLite

In [2]:
import sqlite3

In [3]:
sqlite3.version

'2.6.0'

In [5]:
sqlite3.sqlite_version

'3.26.0'

### DB Server에 접속

In [13]:
con = sqlite3.connect(':memory:') # 경로/파일이름을 넣어도 된다.

In [14]:
cur = con.cursor()

In [15]:
type(conn), type(cur)  # connection 개체와 cursor 객체

(sqlite3.Connection, sqlite3.Cursor)

In [16]:
dir(cur)  # cursor

['__class__',
 '__delattr__',
 '__dir__',
 '__doc__',
 '__eq__',
 '__format__',
 '__ge__',
 '__getattribute__',
 '__gt__',
 '__hash__',
 '__init__',
 '__init_subclass__',
 '__iter__',
 '__le__',
 '__lt__',
 '__ne__',
 '__new__',
 '__next__',
 '__reduce__',
 '__reduce_ex__',
 '__repr__',
 '__setattr__',
 '__sizeof__',
 '__str__',
 '__subclasshook__',
 'arraysize',
 'close',
 'connection',
 'description',
 'execute',
 'executemany',
 'executescript',
 'fetchall',
 'fetchmany',
 'fetchone',
 'lastrowid',
 'row_factory',
 'rowcount',
 'setinputsizes',
 'setoutputsize']

### Execute 연습

In [26]:
cur.execute("select sqlite_version();")

In [27]:
cur.fetchall()

[('3.26.0',)]

In [29]:
sqlite3.complete_statement("")  # SQL문이 완전한지 확인해줌

False

In [ ]:
cur.execute("CREATE TABLE people (name_last, age)")

In [41]:
who = "Yeltsin"
age = 72

In [42]:
# This is the qmark style:
cur.execute("INSERT INTO people VALUES (?,?)",(who, age))
cur.fetchone()

In [43]:
# And this is the named style:
cur.execute("""
    SELECT * 
    FROM people 
    WHERE name_last=:who AND age =:age
""", {"who":who, "age":age})
cur.fetchone()

('Yeltsin', 72)

In [35]:
# Qmark style
sql = "insert into people values (?,?)"
curData = [('A',1), ('B',2), ('C',3)]

cur.executemany(sql, curData)

In [47]:
# Named Style

dataDict = [{"who":"E","age":1},{"who":"F","age":2},{"who":"T","age":3}]
cur.executemany("insert into people values(:who, :age)",dataDict)

In [46]:
cur.execute("SELECT * FROM people")
cur.fetchall()

[('Yeltsin', 72),
 ('Yeltsin', 72),
 ('Yeltsin', 72),
 ('A', 1),
 ('B', 2),
 ('C', 3),
 ('Yeltsin', 72)]

cur.executescript('''SQL1; SQL2; ...''') 식으로 쓸 수 있다.

In [48]:
cur.executescript("""
    CREATE TABLE person(
        first_name text primary key,
        last_name text not null
    );
    
    insert into person values ('name', 'kim')
""")

In [50]:
cur.execute('select * from person')
print(cur.fetchall())

[('name', 'kim')]

cur.fetchone()             # 한 튜플만 들고 옴

cur.fetchmany(size)        # size만큼 튜플을 들고 옴

In [51]:
con.close()

In [52]:
con

### File에 저장

In [62]:
conn = sqlite3.connect('create.db')
print("opened database successfully")
cur = conn.cursor()

opened database successfully

In [63]:
cur.execute('''
    CREATE TABLE COMPANY(
        ID INT PRIMARY KEY NOT NULL,
        NAME TEXT NOT NULL,
        AGE INT NOT NULL,
        ADDRESS CHAR(50),
        SALARY REAL);
''')

print("Table created successfully")

Table created successfully

In [60]:
#cur.execute('drop table company')

### Insert, Update, Delete 모두 commit 하지 않으면 반영 X

### Insert

In [75]:
cur.execute("""
    INSERT INTO company (ID,NAME,AGE,ADDRESS,SALARY)
    VALUES (100, 'PAUL', 32, 'CALIFORNIA', 20000.00)
            """);

cur.execute("""
    INSERT INTO company (ID,NAME,AGE,ADDRESS,SALARY)
    VALUES (:ID,:NAME,:AGE,:ADDRESS,:SALARY)
            """,
           {'ID':200,'NAME':'allen','AGE':25,'ADDRESS':'Texas','SALARY':15000.00});

data = [(300,'Teddy',23,'Norway', 200000.00),(400,'Mark', 25, 'Rich-mond', 65000.00)]

cur.executemany("""
    INSERT INTO company (ID,NAME,AGE,ADDRESS,SALARY) 
    VALUES (?,?,?,?,?)""", data);

cur.executescript("""
    INSERT INTO company (ID,NAME,AGE,ADDRESS,SALARY)
    VALUES (500, 'maaL', 24, 'rich-mond', 60000.00);
    
    INSERT INTO company (ID,NAME,AGE,ADDRESS,SALARY)
    VALUES (600, 'sssaaL', 26, 'rich-mond', 60000.00);

""");

cur.lastrowid
print("success")

IntegrityError: UNIQUE constraint failed: COMPANY.ID

In [77]:
cur.lastrowid

13

In [109]:
conn = sqlite3.connect('create3.db')
print("opened database successfully")
cur = conn.cursor()

opened database successfully

In [110]:
cur.execute('''
    CREATE TABLE COMPANY(
        ID INT PRIMARY KEY NOT NULL,
        NAME TEXT NOT NULL,
        AGE INT NOT NULL,
        ADDRESS CHAR(50),
        SALARY REAL);
''')
print("Table created successfully")

Table created successfully

In [87]:
cur.execute('drop table company')

In [111]:
cur.execute("""
    INSERT INTO company (ID,NAME,AGE,ADDRESS,SALARY)
    VALUES (1, 'PAUL', 32, 'CALIFORNIA', 20000.00)
            """);

ProgrammingError: Cannot operate on a closed database.

In [112]:
conn.commit()

In [113]:
cur.lastrowid, conn.total_changes

(1, 1)

In [114]:
cur.execute("""
    INSERT INTO company (ID,NAME,AGE,ADDRESS,SALARY)
    VALUES (:ID,:NAME,:AGE,:ADDRESS,:SALARY)
            """,
           {'ID':2,'NAME':'allen','AGE':25,'ADDRESS':'Texas','SALARY':15000.00});

data = [(3,'Teddy',23,'Norway', 200000.00),(4,'Mark', 25, 'Rich-mond', 65000.00)]

cur.executemany("""
    INSERT INTO company (ID,NAME,AGE,ADDRESS,SALARY) 
    VALUES (?,?,?,?,?)""", data);

In [119]:
conn.commit()

In [118]:
cur.lastrowid, conn.total_changes

(2, 4)

In [ ]:
conn.commit()

In [120]:
cur.executescript("""
    INSERT INTO company (ID,NAME,AGE,ADDRESS,SALARY)
    VALUES (5, 'maaL', 24, 'rich-mond', 60000.00);
    
    INSERT INTO company (ID,NAME,AGE,ADDRESS,SALARY)
    VALUES (6, 'sssaaL', 26, 'rich-mond', 60000.00);

""");

In [121]:
conn.commit()

In [122]:
cur.lastrowid, conn.total_changes

(2, 6)

In [123]:
cur.lastrowid

2

아래의 코드에서 값을 볼 때 마다 excute로 select 해야함

In [84]:
cur.execute('select * from company')  

for row in cur:
    print("ID = ", row[0])
    print("NAME = ", row[1])
    print("ADDRESS = ", row[2])
    print("SALARY = ", row[3], end = '\n\n')
    
print("Operation done successfully")

ID =  1
NAME =  PAUL
ADDRESS =  32
SALARY =  CALIFORNIA

ID =  2
NAME =  allen
ADDRESS =  25
SALARY =  Texas

ID =  11
NAME =  PAUL
ADDRESS =  32
SALARY =  CALIFORNIA

ID =  10
NAME =  PAUL
ADDRESS =  32
SALARY =  CALIFORNIA

ID =  20
NAME =  allen
ADDRESS =  25
SALARY =  Texas

ID =  100
NAME =  PAUL
ADDRESS =  32
SALARY =  CALIFORNIA

ID =  200
NAME =  allen
ADDRESS =  25
SALARY =  Texas

ID =  300
NAME =  Teddy
ADDRESS =  23
SALARY =  Norway

ID =  400
NAME =  Mark
ADDRESS =  25
SALARY =  Rich-mond

ID =  500
NAME =  maaL
ADDRESS =  24
SALARY =  rich-mond

ID =  600
NAME =  sssaaL
ADDRESS =  26
SALARY =  rich-mond

ID =  101
NAME =  PAUL
ADDRESS =  32
SALARY =  CALIFORNIA

ID =  201
NAME =  allen
ADDRESS =  25
SALARY =  Texas

ID =  301
NAME =  Teddy
ADDRESS =  23
SALARY =  Norway

ID =  401
NAME =  Mark
ADDRESS =  25
SALARY =  Rich-mond

ID =  501
NAME =  maaL
ADDRESS =  24
SALARY =  rich-mond

ID =  601
NAME =  sssaaL
ADDRESS =  26
SALARY =  rich-mond

Operation done successfully

### Update

In [124]:
cid = 1

cur.execute("""
    UPDATE COMPANY set SALARY = 25000.00
    WHERE ID = :id
""", {'id':cid})

In [125]:
conn.commit()  # commit 하기전에 확인하고 commit하기

In [126]:
print("Total number of rows updated :", conn.total_changes)

Total number of rows updated : 7

### Delete

In [127]:
cur.execute("DELETE from COMPANY where ID = 2;")

In [128]:
conn.commit()

### Try, Except, Finally 이용해서 Error handling

(강의자료에 있으니 생략)

### ER-Model로 Quary 만들기

In [136]:
conn = sqlite3.connect('music2.db')
print("opened database successfully")

opened database successfully

In [137]:
cur = conn.cursor()

In [139]:
cur.execute('''
    CREATE TABLE Artist(
        id INTEGER NOT NULL PRIMARY KEY AUTOINCREMENT UNIQUE,
        name TEXT NOT NULL);
''')

cur.execute('''
    CREATE TABLE Genre(
        id INTEGER NOT NULL PRIMARY KEY AUTOINCREMENT UNIQUE,
        name TEXT NOT NULL);
''')

cur.execute('''
    CREATE TABLE Album(
        id INTEGER NOT NULL PRIMARY KEY AUTOINCREMENT UNIQUE,
        title TEXT
        artist_id INT);
''')

print("Table created successfully")

Table created successfully

In [140]:
cur.execute('''
    CREATE TABLE Track(
        id INTEGER NOT NULL PRIMARY KEY AUTOINCREMENT UNIQUE,
        title TEXT,
        length INTEGER,
        rating INTEGER,
        count INTEGER,
        album_id INTEER,
        genre_id INTEGER);
''')

In [141]:
cur.execute("INSERT INTO Artist (name) VALUES ('AAAAAAA')")
cur.execute("INSERT INTO Artist (name) VALUES ('BBBBBBB')")
cur.execute("INSERT INTO Genre (name) VALUES ('Rock')")
cur.execute("INSERT INTO Genre (name) VALUES ('Metal')")

In [142]:
conn.commit()

In [160]:
cur.execute("""
  
        SELECT ID 
        FROM Artist
        WHERE name = 'AAAAAAA';
   
""")

In [161]:
print(cur.fetchall())

[(1,)]

In [162]:
artist = cur.fetchall()

In [168]:
cur.execute("""
    INSERT INTO Album (title, id) 
    VALUES (:album,
        (SELECT ID 
        FROM Artist
        WHERE name=:artist))
""", {"album":"aaaaa", "artist":"AAAAAAA"})

In [169]:
conn.commit()

In [170]:
cur.execute("INSERT INTO Track (title,rating,length,count,album_id,genre_id) VALUES ('AA',5,297,0,2,1);")
cur.execute("INSERT INTO Track (title,rating,length,count,album_id,genre_id) VALUES ('BB',5,482,0,2,1);")
cur.execute("INSERT INTO Track (title,rating,length,count,album_id,genre_id) VALUES ('CC',5,313,0,1,2);")
cur.execute("INSERT INTO Track (title,rating,length,count,album_id,genre_id) VALUES ('DD',5,207,0,1,2);")

In [171]:
conn.commit()

### (inner) JOIN

In [172]:
cur.execute("""SELECT Album.title, Artist.name
FROM Album
JOIN Artist
ON Album.id = Artist.id""")

In [173]:
print(cur.fetchall())

[('aaaaa', 'AAAAAAA')]

In [174]:
cur.execute("""SELECT Track.title, Genre.name
FROM Track
JOIN Genre
ON Track.id = Genre.id""")

In [175]:
print(cur.fetchall())

[('AA', 'Rock'), ('BB', 'Metal')]

In [176]:
cur.execute("""SELECT Track.title, Album.title
FROM Track
JOIN Album
ON Track.id = Album.id""")
print(cur.fetchall())

[('AA', 'aaaaa')]

In [178]:
cur.execute("""
SELECT Track.title, Album.title, Artist.name, Genre.name
FROM Track
JOIN Artist JOINAlbum JOIN Genre 
        ON Track.id = Track.album_id 
        and Track.genre_id = Genre.id
        and Album.artist_id = Artist.id
"""
    )
print(cur.fetchall())

OperationalError: no such column: Album.title